---
kind: property
id: P:Autodesk.Revit.DB.RuledFace.Point(System.Int32)
zh: 点
source: html/b4102dd4-581e-1c7a-857d-e3fe1c2e0f7e.htm
---
# Autodesk.Revit.DB.RuledFace.Point Property

**中文**: 点

Profile points of the surface.

## Syntax (C#)
```csharp
public XYZ this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`)